==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GPTLanguageModel                         [1, 3, 62]                --
├─Embedding: 1-1                         [1, 3, 128]               7,936
├─Embedding: 1-2                         [1, 3, 128]               128,000
├─ModuleList: 1-3                        --                        --
│    └─TransformerBlock: 2-1             [1, 3, 128]               --
│    │    └─MultiHeadAttention: 3-1      [1, 3, 128]               66,048
│    │    └─LayerNorm: 3-2               [1, 3, 128]               256
│    │    └─Dropout: 3-3                 [1, 3, 128]               --
│    │    └─Sequential: 3-4              [1, 3, 128]               65,920
│    │    └─LayerNorm: 3-5               [1, 3, 128]               256
│    │    └─Dropout: 3-6                 [1, 3, 128]               --
│    └─TransformerBlock: 2-2             [1, 3, 128]               --
│    │    └─MultiHeadAttention: 3-7      [1, 3, 128]               66,048
│    │    └─LayerNorm: 3-8               [1, 3, 128]               256
│    │    └─Dropout: 3-9                 [1, 3, 128]               --
│    │    └─Sequential: 3-10             [1, 3, 128]               65,920
│    │    └─LayerNorm: 3-11              [1, 3, 128]               256
│    │    └─Dropout: 3-12                [1, 3, 128]               --
│    └─TransformerBlock: 2-3             [1, 3, 128]               --
│    │    └─MultiHeadAttention: 3-13     [1, 3, 128]               66,048
│    │    └─LayerNorm: 3-14              [1, 3, 128]               256
│    │    └─Dropout: 3-15                [1, 3, 128]               --
│    │    └─Sequential: 3-16             [1, 3, 128]               65,920
│    │    └─LayerNorm: 3-17              [1, 3, 128]               256
│    │    └─Dropout: 3-18                [1, 3, 128]               --
│    └─TransformerBlock: 2-4             [1, 3, 128]               --
│    │    └─MultiHeadAttention: 3-19     [1, 3, 128]               66,048
│    │    └─LayerNorm: 3-20              [1, 3, 128]               256
│    │    └─Dropout: 3-21                [1, 3, 128]               --
│    │    └─Sequential: 3-22             [1, 3, 128]               65,920
│    │    └─LayerNorm: 3-23              [1, 3, 128]               256
│    │    └─Dropout: 3-24                [1, 3, 128]               --
├─LayerNorm: 1-4                         [1, 3, 128]               256
├─Linear: 1-5                            [1, 3, 62]                7,998
==========================================================================================
Total params: 674,110
Trainable params: 674,110
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.67
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.12
Params size (MB): 2.70
Estimated Total Size (MB): 2.82
==========================================================================================